examples/bending_flap/fluid-openfoam/system/decomposeParDict
FoamFile {
    version 2.0;
    class dictionary;
    object decomposeParDict;
    format ascii;
}

numberOfSubdomains 12;

method          simple;

simpleCoeffs
{
    n               (2 2 3);
    delta           0.001;
}

