examples/bending_flap/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh-Nodes;
    patches           (flap);
    locations         faceNodes;
    
    readData
    (
      Displacement
    );

    writeData
    (
    );
  };

  Interface2
  {
    mesh              Fluid-Mesh-Faces;
    patches           (flap);
    locations         faceCenters;

    readData
    (
    );
    
    writeData
    (
      Stress
    );
  };
};

FSI
{
  rho rho [1 -3 0 0 0 0 0] 1;
}
